<div style="text-align: center; color: blue; font-size: 36px; font-weight: bold;">
SQL
</div>

In [3]:
import pandas as pd
import sqlalchemy

In [4]:
#engine=sqlalchemy.create_engine('mysql+pymysql://root:w7301@jqir#@localhost:3306//clg')
from sqlalchemy.engine.url import URL
from sqlalchemy import create_engine

db_url = URL.create(
    drivername="mysql+pymysql",
    username="root",
    password="w7301@jqir#",  # Special characters handled properly
    host="localhost",
    port=3306,
    database="clg"
)

engine = create_engine(db_url)

In [12]:
df=pd.read_sql_table('student',engine)
df

    id    name
0  103  shreya
1  104    asha

In [6]:
query=''' select name from students where city='patan' '''
df=pd.read_sql_query(query,engine)
df

      name
0    chaku
1     sona
2    ronna
3  darshan

In [13]:
df=pd.read_csv('sp.csv')
df

    id   name
0  105  chiku
1  106   miku

In [14]:
df.to_sql(
    name='student',
    con=engine,
    index=False,
    if_exists='append'


)# data append thai gayo fari run karie atale error batave primary key che atale

2

In [15]:
df

    id   name
0  105  chiku
1  106   miku

In [16]:
df=pd.read_sql_table('student',engine)
df

    id    name
0  103  shreya
1  104    asha
2  105   chiku
3  106    miku